import numpy as np
import matplotlib.pyplot as plt

data = [('გვრიტიშვილი', 93.62318841, 345),('ალავიძე', 100, 105), ('ქიმერიძე', 95.15151515, 165), ('ჯახველაძე', 92.65306122, 245),('მოთიაშვილი', 92.47524752, 1010), ('აბაშიძე', 90.48275862, 725), ('ჭიტაძე', 90, 275), ('კვარაცხელია', 89.42857143, 350), ('კილასონია', 88.46846847, 277.5),('ზაბახიძე', 100, 55), ('რაზმაძე', 100, 90),('ვარადაშვილი', 90.20408163, 122.5), ('შავაძე', 88.95522388, 167.5),('ღომიძე', 91.11111111, 22.5),('გრძელიშვილი', 83.51851852, 810), ('ფოფხაძე', 81.92307692, 260), ('წითლაური', 81.18518519, 337.5), ('შუბითიძე', 76.33333333, 300), ('ძინძიბაძე', 76.27118644, 442.5), ('ვახტანგაშვილი', 74.94071146, 632.5), ('აბრამიანი', 74.33962264, 397.5), ('პაპუნაშვილი', 71.46245059, 632.5), ('გურგენიძე', 66.77966102, 295), ('ვანიშვილი', 62.45614035, 285), ('ლორთქიფანიძე', 50.22222222, 337.5),('ისაკაძე', 84.09638554, 207.5), ('არახამია', 81.9047619, 105), ('ქორიძე', 79.71830986, 177.5), ('კოჩალიძე', 79.2, 187.5), ('სამსონიძე', 78.5106383, 235), ('ხუბერიშვილი', 76.2962963, 202.5), ('ანდრია კობახიძე', 71.01449275, 172.5), ('მელიქჯანიანი', 66.66666667, 210), ('გუჯაბიძე', 66.52173913, 230), ('სვანიძე', 59.21568627, 127.5), ('კვინჩია', 50.66666667, 187.5), ('ხუსკივაძე', 46.41509434, 132.5), ('ბექაური', 45.2173913, 115), ('ედიშერაშვილი', 12.97297297, 185),('ნუცუბიძე', 74.85714286, 87.5), ('ვარაზაშვილი', 53.33333333, 90), ('აკოფიანი', 38.88888889, 90), ('ხუციშვილი', 0, 67.5)]

names = [item[0] for item in data]
coefficients = [item[1] for item in data]
salaries = [item[2] for item in data]

# Plotting
plt.figure(figsize=(10, 8))
plt.barh(names, coefficients, color='#004225')
plt.xlabel('Work Coefficient')
plt.ylabel('Squad Leaders')
plt.title('Work Coefficient by Leader')
plt.suptitle("From best to worst")
plt.gca().invert_yaxis()
plt.grid(axis="x", lw=1)

# Font size
plt.yticks(fontsize=7)

plt.show()