import numpy as np
import matplotlib.pyplot as plt

data = [
    ('გრძელიშვილი', 96.875, 400), ('თეზელაშვილი', 96.36363636, 302.5), ('ზაბახიძე', 95.71428571, 280), ('გაგნიძე', 95.34883721, 322.5), ('გიორგელაშვილი', 95.13513514, 370), ('ვანიშვილი', 94.87179487, 292.5),
    ('დიასამიძე', 96.12903226, 155), ('მოთიაშვილი', 94.52054795, 182.5), ('რაზმაძე', 93.6, 250),
    ('ბაკურაძე', 100, 52.5), ('გურგენიძე', 100, 85), ('შავაძე', 100, 50), ('მოწონელიძე', 100, 22.5), ('ხუსკივაძე', 100, 22.5), ('სვანიძე', 100, 22.5), ('კილასონია', 100, 15), ('ტყეშელაშვილი', 100, 7.5), ('სიხარულიძე', 100, 7.5), ('ბერკაცაშვილი', 97.57575758, 82.5), ('მოლოდინი', 95.55555556, 90),
    ('ფოფხაძე', 91.89873418, 197.5), ('ბერიძე', 87.90697674, 215), ('ჯანაშია', 86.83544304, 197.5),
    ('ამონაშვილი', 92.38095238, 52.5), ('არღუთაშვილი', 89.09090909, 27.5),
    ('ჯანეზაშვილი', 75.23809524, 315), ('ბაბაჯანაშვილი', 52.62135922, 257.5),
    ('ნავროზაშვილი', 81.06666667, 187.5), ('ვახტანგაშვილი', 80.61538462, 162.5), ('თირქია', 80.37735849, 132.5), ('თინიკაშვილი', 79.18367347, 122.5), ('ფილიშვილი', 76.84210526, 142.5), ('საზანდრიშვილი', 76.76767677, 247.5), ('ნუცუბიძე', 38.53658537, 102.5),
    ('ქიმერიძე', 80.95238095, 52.5), ('ლევერაშვილი', 75.33333333, 75), ('დოლიძე', 0, 60)
]

# Extracting individual lists from the data
names = [item[0] for item in data]
coefficients = [item[1] for item in data]
salaries = [item[2] for item in data]

# Plotting
plt.figure(figsize=(12, 8))
plt.barh(names, coefficients, color='#634234')
plt.xlabel('Work Coefficient')
plt.ylabel('Squad Leaders')
plt.title('Work Coefficient by Leader')
plt.suptitle("From best to worst")
plt.gca().invert_yaxis()
plt.grid(axis="x", lw=1)
plt.show()