# მონაცემების შეტანა
starting_list = []

def sort_users(name, weight, push_up_count):
    starting_list.append([name, weight, push_up_count])

sort_users("ანამარია მაჩაიძე", 24, 0)
sort_users("ილია თავართქილაძე", 29, 0)
sort_users("გიორგი მენთეშაშვილი", 31, 0)
sort_users("ნიკოლოზ ჯღამაძე", 32, 0)
sort_users("ლაზარე ვეკუა", 32, 0)
sort_users("ლუკა ვეკუა", 32, 0)
sort_users("თედი ხმალაძე", 35, 0)
sort_users("საბა სესიტაშვილი", 35, 0)
sort_users("გიორგი ასლამაზიშვილი", 35, 0)
sort_users("გიგა ბუცხრიკიძე", 35, 0)
sort_users("მათე არჩვაძე", 40, 0)
sort_users("ლუკა ადამაშვილი", 40, 0)
sort_users("დავით ჩანკსელიანი", 41, 0)
sort_users("დავითი მაჭავარიანი", 42, 0)
sort_users("კახა კალანდაძე", 42, 0)
sort_users("ნიკა კარამოვი", 43, 0)
sort_users("გიორგი ქააძე", 43, 0)
sort_users("გიორგი ყორანაშვილი", 45, 0)
sort_users("გვანცა მაზანიშვილი", 45, 0)
sort_users("საბა გურასაშვილი", 47, 0)
sort_users("რეზო ხარბედია", 49, 0)
sort_users("ალექსანდრე ანთია", 50, 0)
sort_users("ნიკა სამადაშვილი", 53, 0)
sort_users("საბა ცერცვაძე", 55, 0)
sort_users("გიორგი ზოსიძე", 56, 0)
sort_users("რეზი ჯოყილაძე", 61, 0)
sort_users("ანდრია მოლაშვილი", 69, 0)
sort_users("ნიკოლოზ ნადირაშვილი", 70, 0)
sort_users("გიორგი კაპანაძე", 78, 0)
sort_users("ბასა ბირთველიშვილი", 115, 0)

# მახასიათებლის გამოთვლა
sorted_list = []
def sort_data(list):
    sorted_list.append([list[0], (list[2] * list[1] / 20)])

for i in range(len(starting_list)):
    sort_data(starting_list[i])


# სიის დასორტირება
sorted_list.sort(key=lambda x: x[1], reverse=True)


# dict-ის სახით დაბეჭვდა
user_dict = dict()

for list in sorted_list:
    user_dict[list[0]] = list[1]

print(user_dict)


# result
# {'ბატონი ნიკა': 216.0, 'სანდრო სიუკაშვილი': 202.5, 'თორნიკე ბერიძე ': 197.1, 'თორნიკე ხურცია': 195.2, 'ალექსი ბახტაძე': 169.6, 'გიორგი ხმალაძე': 166.6, 'ზუკა აბაშიძე': 164.15, 'დათა თეზელაშვილი': 162.5, 'დავით ტუღუში': 159.5, 'ლუკა გორგაძე': 157.5, 'ალექსანდრე შალიკაშვილი': 156.0, 'ალექსანდრე რევია': 153.7, 'მევლუდი თავაძე': 152.1, 'ნიკა კახაძე': 137.8, 'ნიკოლოზი დობორჯგინიძე': 137.5, 'გიორგი გლოველი': 126.75, 'ნიკოლოზ ბაღათურია': 125.8, 'ბაჩანა ტყემალაძე': 124.8, 'ზურა ცინცაძე': 123.75, 'ირაკლი ოზაშვილი': 122.5, 'ლუკა დგებუაძე ': 116.0, 'ლუკა მახარაძე': 114.0, 'საბა ისაკაძე': 110.0, 'ანრი გიუნაშვილი': 110.0, 'ლევან სხულუხია': 108.0, 'ნიკოლოზ ტეფნაძე': 101.5, 'ირაკლი მებონია': 101.4, 'თორნიკე ნებიერიძე': 100.8, 'biba nikuradze': 100.05, 'საბა ბეგიაშვილი': 99.2, 'გაბრიელ გვასალია': 92.75, 'უმარ აბუბაკაროვი': 91.3, 'ucha khuberishvili': 86.8, 'ჟანა გაბლია': 71.5, 'ზურა გვალია': 66.75, 'ბექა ოღრაპიშვილი': 64.0, 'დავით ფხაკაძე': 60.3, 'საბა ფუთურიძე': 48.0, 'ალექსანდრე ჩიხლაძე': 46.25, 'მათე ჩუბინიძე': 40.0}