# მონაცემების შეტანა
starting_list = []

def sort_users(name, weight, push_up_count):
    starting_list.append([name, weight, push_up_count])

sort_users("ალექსანდრე ჩიხლაძე", 37, 25)
sort_users("ზურა ცინცაძე", 45, 55)
sort_users("ლუკა გორგაძე", 45, 70)
sort_users("საბა ფუთურიძე", 48, 20)
sort_users("საბა ისაკაძე", 50, 44)
sort_users("მათე ჩუბინიძე", 50, 16)
sort_users("გაბრიელ გვასალია", 53, 35)
sort_users("ალექსი ბახტაძე", 53, 64)
sort_users("თორნიკე ბერიძე ", 54, 73)
sort_users("დავით ტუღუში", 55, 58)
sort_users("ჟანა გაბლია", 55, 26)
sort_users("ანრი გიუნაშვილი", 55, 40)
sort_users("ნიკოლოზი დობორჯგინიძე", 55, 50)
sort_users("ალექსანდრე რევია", 58, 53)
sort_users("ლუკა დგებუაძე ", 58, 40)
sort_users("ნიკოლოზ ტეფნაძე", 58, 35)
sort_users("ალექსანდრე შალიკაშვილი", 60, 52)
sort_users("ucha khuberishvili", 62, 28)
sort_users("თორნიკე ნებიერიძე", 63, 32)
sort_users("თორნიკე ხურცია", 64, 61)
sort_users("ბექა ოღრაპიშვილი", 64, 20)
sort_users("ბაჩანა ტყემალაძე", 64, 39)
sort_users("საბა ბეგიაშვილი", 64, 31)
sort_users("დათა თეზელაშვილი", 65, 50)
sort_users("გიორგი გლოველი", 65, 39)
sort_users("ზუკა აბაშიძე", 67, 49)
sort_users("დავით ფხაკაძე", 67, 18)
sort_users("გიორგი ხმალაძე", 68, 49)
sort_users("ნიკოლოზ ბაღათურია", 68, 37)
sort_users("biba nikuradze", 69, 29)
sort_users("ირაკლი ოზაშვილი", 70, 35)
sort_users("ლევან სხულუხია", 72, 30)
sort_users("ირაკლი მებონია", 78, 26)
sort_users("ლუკა მახარაძე", 76, 30)
sort_users("მევლუდი თავაძე", 78, 39)
sort_users("უმარ აბუბაკაროვი", 83, 22)
sort_users("სანდრო სიუკაშვილი", 90, 45)
sort_users("ბატონი ნიკა", 90, 48)
sort_users("ზურა გვალია", 89, 15)
sort_users("ნიკა კახაძე", 106, 26)


# მახასიათებლის გამოთვლა
sorted_list = []
def sort_data(list):
    sorted_list.append([list[0], (list[2] * list[1] / 20)])

for i in range(len(starting_list)):
    sort_data(starting_list[i])


# სიის დასორტირება
sorted_list.sort(key=lambda x: x[1], reverse=True)


# dict-ის სახით დაბეჭვდა
user_dict = dict()

for list in sorted_list:
    user_dict[list[0]] = list[1]

print(user_dict)


# result
# {'ბატონი ნიკა': 216.0, 'სანდრო სიუკაშვილი': 202.5, 'თორნიკე ბერიძე ': 197.1, 'თორნიკე ხურცია': 195.2, 'ალექსი ბახტაძე': 169.6, 'გიორგი ხმალაძე': 166.6, 'ზუკა აბაშიძე': 164.15, 'დათა თეზელაშვილი': 162.5, 'დავით ტუღუში': 159.5, 'ლუკა გორგაძე': 157.5, 'ალექსანდრე შალიკაშვილი': 156.0, 'ალექსანდრე რევია': 153.7, 'მევლუდი თავაძე': 152.1, 'ნიკა კახაძე': 137.8, 'ნიკოლოზი დობორჯგინიძე': 137.5, 'გიორგი გლოველი': 126.75, 'ნიკოლოზ ბაღათურია': 125.8, 'ბაჩანა ტყემალაძე': 124.8, 'ზურა ცინცაძე': 123.75, 'ირაკლი ოზაშვილი': 122.5, 'ლუკა დგებუაძე ': 116.0, 'ლუკა მახარაძე': 114.0, 'საბა ისაკაძე': 110.0, 'ანრი გიუნაშვილი': 110.0, 'ლევან სხულუხია': 108.0, 'ნიკოლოზ ტეფნაძე': 101.5, 'ირაკლი მებონია': 101.4, 'თორნიკე ნებიერიძე': 100.8, 'biba nikuradze': 100.05, 'საბა ბეგიაშვილი': 99.2, 'გაბრიელ გვასალია': 92.75, 'უმარ აბუბაკაროვი': 91.3, 'ucha khuberishvili': 86.8, 'ჟანა გაბლია': 71.5, 'ზურა გვალია': 66.75, 'ბექა ოღრაპიშვილი': 64.0, 'დავით ფხაკაძე': 60.3, 'საბა ფუთურიძე': 48.0, 'ალექსანდრე ჩიხლაძე': 46.25, 'მათე ჩუბინიძე': 40.0}