import numpy as np
import matplotlib.pyplot as plt

data = [('ჯახველაძე', 98.28571429, 175), ('გუჯაბიძე', 94.28571429, 210), ('ვარადაშვილი', 93.91304348, 115),('სამსონიძე', 90.55555556, 270), ('ფოფხაძე', 89.17431193, 272.5), ('ვანიშვილი', 86.66666667, 300), ('აბრამიანი', 85.03703704, 337.5),('ზაბახიძე', 92, 237.5), ('სვანიძე', 85.84615385, 162.5),('ჯიმშიაშვილი', 91.51515152, 82.5),('გრძელიშვილი', 84, 750), ('კილასონია', 83.58208955, 335), ('აბაშიძე', 81.30653266, 497.5), ('შუბითიძე', 77.5, 320), ('მოთიაშვილი', 77.4789916, 595), ('პაპუნაშვილი', 75.77777778, 450), ('გურგენიძე', 73.96825397, 315), ('დოლიძე', 66.2745098, 255), ('ვახტანტაშვილი', 36.98630137, 547.5),('ძინძიბაძე', 84.70588235, 170), ('შავაძე', 78.88888889, 180), ('ქიმერიძე', 77.5, 120), ('ხუსკივაძე', 75.89041096, 182.5), ('ჭიტაძე', 74.02597403, 192.5), ('ყვავაძე', 71.89873418, 197.5), ('გიორგელაშვილი', 70.21276596, 235), ('გვრიტიშვილი', 69.375, 240), ('ისაკაძე', 67.24137931, 145), ('მელიქჯანიანი', 54.71698113, 132.5), ('ხუბერიშვილი', 54.28571429, 157.5), ('აკოფიანი', 50.32258065, 155),('წითლაური', 48, 187.5),('კვარაცხელია', 80, 95), ('ვარაზაშვილი', 78.51851852, 67.5), ('ჯალაღონია', 56.92307692, 65), ('ბექაური', -1.714285714, 87.5)]

names = [item[0] for item in data]
coefficients = [item[1] for item in data]
salaries = [item[2] for item in data]

# Plotting
plt.figure(figsize=(10, 8))
plt.barh(names, coefficients, color='#004225')
plt.xlabel('Work Coefficient')
plt.ylabel('Squad Leaders')
plt.title('Work Coefficient by Leader')
plt.suptitle("From best to worst")
plt.gca().invert_yaxis()
plt.grid(axis="x", lw=1)

# Font size
plt.yticks(fontsize=7)

plt.show()