import numpy as np
import matplotlib.pyplot as plt

data = [('გურგენიძე', 98.16793893, 327.5), ('ყვავაძე', 95.55555556, 270), ('სამსონიძე', 92.78481013, 395), ('გიორგელაშვილი', 92.63157895, 285),('ისაკაძე', 100, 152.5), ('ძინძიბაძე', 98.46153846, 162.5), ('ჟუჟუნაძე', 97.71428571, 175), ('გუჯაბიძე', 96.25, 160), ('ხუსკივაძე', 93.65853659, 205),('სვანიძე', 92.88135593, 147.5),('კილასონია', 91.86440678, 295), ('ვანიშვილი', 90.63492063, 315), ('მოთიაშვილი', 89.93710692, 397.5), ('ზაბახიძე', 89.92907801, 352.5), ('ფოფხაძე', 88.90625, 320), ('გაგნიძე', 85.84070796, 282.5), ('შუბითიძე', 85.44, 312.5),('ქიმერიძე', 98.51851852, 67.5),('მოწონელიძე', 92, 162.5), ('ჯახველაძე', 91.17647059, 170), ('ნუცუბიძე', 87.9245283, 132.5),('ვარაზაშვილი', 90, 75),('საზანდრიშვილი', 76.16666667, 300), ('აბრამიანი', 65.66666667, 300), ('გრძელიშვილი', 62.0083682, 597.5), ('ვახტანგაშვილი', 42.06896552, 580), ('ნარიმანიძე', -5.34351145, 327.5),('აბაშიძე', 84.84210526, 237.5), ('ღომიძე', 83.22580645, 155), ('ნავროზაშვილი', 79.15492958, 177.5), ('პაპუნაშვილი', 78.75, 160), ('ნატროშვილი', 76.4516129, 155), ('წითლაური', 75.11111111, 112.5), ('მათე დოლიძე', 73.125, 160), ('შავაძე', 68.62745098, 127.5), ('ფილიშვილი', 68.25396825, 157.5), ('ჯალაღონია', 66.66666667, 105), ('ნუკრაძე', 58.96103896, 192.5), ('არღუთაშვილი', 36.58536585, 205), ('კვარაცხელია', 34.83870968, 155),('აკოფიანი', 84.76190476, 52.5), ('ბექაური', 80, 45), ('გვრიტიშვილი', 70, 90), ('იოანე დოლიძე', 56.92307692, 97.5), ('თირქია', 39.45945946, 92.5), ('ვარადაშვილი', 35, 100)]

names = [item[0] for item in data]
coefficients = [item[1] for item in data]
salaries = [item[2] for item in data]

# Plotting
plt.figure(figsize=(10, 8))
plt.barh(names, coefficients, color='#004225')
plt.xlabel('Work Coefficient')
plt.ylabel('Squad Leaders')
plt.title('Work Coefficient by Leader')
plt.suptitle("From best to worst")
plt.gca().invert_yaxis()
plt.grid(axis="x", lw=1)

# Font size
plt.yticks(fontsize=7)

plt.show()