import numpy as np
import matplotlib.pyplot as plt

data = [('გურგენიძე', 98.75, 320),('კვარაცხელია', 95.76719577, 189), ('სამსონიძე', 92.76595745, 235),('მოთიაშვილი', 92.02247191, 890), ('კილასონია', 90.98143236, 377), ('გრძელიშვილი', 89.38992042, 1131), ('ვანიშვილი', 88.87195122, 328), ('შუბითიძე', 88.61256545, 382), ('აბაშიძე', 88.42364532, 812),('ლორთქიფანიძე', 100, 21),('ხუბერიშვილი', 90.99378882, 161), ('ჯახველაძე', 89.93902439, 164), ('ჭიტაძე', 85.71428571, 161),('რაზმაძე', 91.17647059, 34), ('ალავიძე', 90.90909091, 66), ('ნუცუბიძე', 87.5, 48), ('ბექაური', 86.07594937, 79),('პაპუნაშვილი', 82.50460405, 543), ('ვახტანგაშვილი', 78.83165829, 796), ('აბრამიანი', 78.44611529, 399),('გუჯაბიძე', 84.12698413, 189), ('გიორგელაშვილი', 83.50515464, 194), ('სვანიძე', 78.62068966, 145), ('ძინძიბაძე', 76.55172414, 145), ('ფოფხაძე', 73.52941176, 238), ('გვრიტიშვილი', 72.47706422, 218), ('შავაძე', 70.23809524, 168), ('წითლაური', 67.78350515, 194), ('ზაბახიძე', 67.66169154, 201), ('ხუსკივაძე', 67.22689076, 238), ('ისაკაძე', 66.66666667, 189), ('დოლიძე', 41.26213592, 206), ('კვინჩია', 37.88819876, 161), ('აკოფიანი', 24.13793103, 145), ('ყვავაძე', 0, 191),('ვარადაშვილი', 81.94444444, 72), ('ჯიმშიაშვილი', 79.41176471, 68), ('მელიქჯანიანი', 60.29411765, 68), ('ქიმერიძე', 58.64197531, 81), ('ვარაზაშვილი', 49.18032787, 61), ('ქორიძე', 40.27777778, 72), ('ღომიძე', 0, 7)]

names = [item[0] for item in data]
coefficients = [item[1] for item in data]
salaries = [item[2] for item in data]

# Plotting
plt.figure(figsize=(10, 8))
plt.barh(names, coefficients, color='#004225')
plt.xlabel('Work Coefficient')
plt.ylabel('Squad Leaders')
plt.title('Work Coefficient by Leader')
plt.suptitle("From best to worst")
plt.gca().invert_yaxis()
plt.grid(axis="x", lw=1)

# Font size
plt.yticks(fontsize=7)

plt.show()